<details><summary>Digger run report at 2023-10-10 18:11:03 (UTC)</summary>
        <details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

available_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
  "us-east-1d",
  "us-east-1e",
  "us-east-1f",
])
first_3_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_eks</b></summary>
  
```terraform
module.kms.data.aws_partition.current: Reading...
data.aws_partition.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
aws_security_group.cluster[0]: Refreshing state... [id=sg-00fcfc735f82157a5]
aws_security_group.node[0]: Refreshing state... [id=sg-06030b690dc3cf699]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253703900000005]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253825000000007]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253779600000006]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-20231010122254001300000009]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-20231010122253998600000008]
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3318154131]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=4ae4b33a-e625-4432-bd8f-40d15d026488]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-647261123]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3610322247]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1427226253]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-83275930]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-585937255]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4279920852]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1179484844]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2622740763]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-4144928800]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3091680380]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2695435125]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101012231641330000000a]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-2023101012231685260000000b]
time_sleep.this[0]: Refreshing state... [id=2023-10-10T12:31:41Z]
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-00a98a4bbb01879a7,Environment]
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-00a98a4bbb01879a7,Terraform]
data.tls_certificate.this[0]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0605c3223d27b442d]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101012314309990000000e]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-staging:general-2023101012314309990000000e"
      + labels                 = {}
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
  ~ eks_managed_node_groups                          = {
      ~ general = {
          ~ node_group_labels                  = null -> {}
            # (15 unchanged attributes hidden)
        }
    }

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

Warning: Argument is deprecated

  with aws_eks_addon.this["vpc-cni"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

aws_auth_configmap_yaml = <<EOT
apiVersion: v1
kind: ConfigMap
metadata:
  name: aws-auth
  namespace: kube-system
data:
  mapRoles: |
    - rolearn: arn:aws:iam::039454511521:role/general-eks-node-group-20231010122252969900000002
      username: system:node:{{EC2PrivateDNSName}}
      groups:
        - system:bootstrappers
        - system:nodes

EOT
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:039454511521:log-group:/aws/eks/eks-staging/cluster"
cloudwatch_log_group_name = "/aws/eks/eks-staging/cluster"
cluster_addons = {
  "coredns" = {
    "addon_name" = "coredns"
    "addon_version" = "v1.10.1-eksbuild.4"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/coredns/92c58cca-5194-9bec-7e18-f5b9b6df8fc3"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:coredns"
    "modified_at" = "2023-10-10T12:34:53Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "kube-proxy" = {
    "addon_name" = "kube-proxy"
    "addon_version" = "v1.28.2-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/kube-proxy/3cc58cca-5197-2352-1784-e5342e6023f8"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:kube-proxy"
    "modified_at" = "2023-10-10T12:34:46Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "vpc-cni" = {
    "addon_name" = "vpc-cni"
    "addon_version" = "v1.15.0-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/vpc-cni/e6c58cca-5193-6cbb-8ef0-60e98ccf5a90"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:vpc-cni"
    "modified_at" = "2023-10-10T12:34:47Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
}
cluster_arn = "arn:aws:eks:us-east-1:039454511521:cluster/eks-staging"
cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQ2h0N2ZtallCUkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01UQXhNakl6TVRWYUZ3MHpNekV3TURjeE1qSTRNVFZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUN3MGxJUWtLam1nczMyTUZkdGJTWG1Rd1ZwakZDWUdzT2lJb1B0YithdDlUMnVHQjRYdUFUdVVwZTAKV3krM1p0MVZOSmhKSlo0SUlJT05sYi9iZTE1NGw5MW1ISm9pd0hqUllBSEw5bDdpM244TjFSREtOb3hSbUxMUQo1YWIxNEI2RkdZd1M3SzlWYmlxNDlGRTdyaVJoT2srMU9lME1pVWJyZXQxVmRVamFmQTVyZGU5RlBrNVJ0ZXdxCko4NVlwbHdQcjVtVExpYnpadW85WHgwNjlUYnpvT2hkRFI1K2U5VlM2RkNwU09ZQzVNQ3Rsb3RkSVBCOUFaa0sKNXlEcFB3SWlrZ2d4VHNmVFcrelUyVWQwTFRLRG9ET3V1a3dLRkpDOWNTVXM1V1o4L2tiNHI5YXNxMFMzRUpFMgpMaW52eUlHRDZCNlY2RnA1QUNVYnhSWXdIeWcxQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSSlFvdjgyNmN1MEZtSmhaUkhkSkRZOEJsQTlEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUc2ZjQ5bE5jSApaZjFBbG9JMjhkbzhmbTVKVEllMnFiNVhqVXpMT0ExbVhtVEVGc1ExWmxKODNMTG5LdnArTzRMeFJpUzZMbzFkCmNNQnowVWlQSitiMWtzQWVIbSsrMElWb3RqbWFVSjlxaW83TkR1TENJK1NDaXY2RlVCckE3bVdkalBXU2ppVi8KaVlWQklMd3hVdU9OTlR4eDhpeHpMdTRkV2lIZHhQbVBiVnZXdFZGejlMWWF3bUVqU1JyVjd5eEVhNEtLS1o1OApRTUJQN1pma0UwNFI0MDNSNStpQ3h6WUdwTTJOakIxR09JcDl0eWRqbGRLR25oU3JQZWZiQTJnMm12bGVseXFRCkVtbVJqck9NVHJCMzljV01sWVl2dFFLcEdkVkxHdXd0VUdlcnBTVkxPa1llcjVUOEZtMDBKdFgwbndhNzVTaEoKc3JCazRpL3ZTMExZCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
cluster_endpoint = "https://8AED6A08DAB2457C338B576A51CD266D.gr7.us-east-1.eks.amazonaws.com"
cluster_iam_role_arn = "arn:aws:iam::039454511521:role/eks-staging-cluster-20231010122252968700000001"
cluster_iam_role_name = "eks-staging-cluster-20231010122252968700000001"
cluster_iam_role_unique_id = "AROAQSL5MCGQ63S6AQKY6"
cluster_identity_providers = {}
cluster_name = "eks-staging"
cluster_oidc_issuer_url = "https://oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
cluster_platform_version = "eks.1"
cluster_primary_security_group_id = "sg-00a98a4bbb01879a7"
cluster_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-00fcfc735f82157a5"
cluster_security_group_id = "sg-00fcfc735f82157a5"
cluster_status = "ACTIVE"
cluster_tls_certificate_sha1_fingerprint = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
cluster_version = "1.28"
eks_managed_node_groups = {
  "general" = {
    "autoscaling_group_schedule_arns" = {}
    "iam_role_arn" = "arn:aws:iam::039454511521:role/general-eks-node-group-20231010122252969900000002"
    "iam_role_name" = "general-eks-node-group-20231010122252969900000002"
    "iam_role_unique_id" = "AROAQSL5MCGQZ3CAKRYMG"
    "launch_template_arn" = "arn:aws:ec2:us-east-1:039454511521:launch-template/lt-0605c3223d27b442d"
    "launch_template_id" = "lt-0605c3223d27b442d"
    "launch_template_latest_version" = 1
    "launch_template_name" = "general-2023101012314273110000000c"
    "node_group_arn" = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101012314309990000000e/96c58cc9-2c25-bb44-4b68-28908f64a3a8"
    "node_group_autoscaling_group_names" = [
      "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8",
    ]
    "node_group_id" = "eks-staging:general-2023101012314309990000000e"
    "node_group_labels" = tomap({})
    "node_group_resources" = tolist([
      {
        "autoscaling_groups" = tolist([
          {
            "name" = "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8"
          },
        ])
        "remote_access_security_group_id" = ""
      },
    ])
    "node_group_status" = "ACTIVE"
    "node_group_taints" = toset([])
    "platform" = "linux"
  }
}
eks_managed_node_groups_autoscaling_group_names = tolist([
  "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8",
])
fargate_profiles = {}
kms_key_arn = "arn:aws:kms:us-east-1:039454511521:key/4ae4b33a-e625-4432-bd8f-40d15d026488"
kms_key_id = "4ae4b33a-e625-4432-bd8f-40d15d026488"
kms_key_policy = "{\"Statement\":[{\"Action\":[\"kms:Update*\",\"kms:UntagResource\",\"kms:TagResource\",\"kms:ScheduleKeyDeletion\",\"kms:Revoke*\",\"kms:Put*\",\"kms:List*\",\"kms:Get*\",\"kms:Enable*\",\"kms:Disable*\",\"kms:Describe*\",\"kms:Delete*\",\"kms:Create*\",\"kms:CancelKeyDeletion\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:user/rimvydas\"},\"Resource\":\"*\",\"Sid\":\"KeyAdministration\"},{\"Action\":[\"kms:ReEncrypt*\",\"kms:GenerateDataKey*\",\"kms:Encrypt\",\"kms:DescribeKey\",\"kms:Decrypt\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:role/eks-staging-cluster-20231010122252968700000001\"},\"Resource\":\"*\",\"Sid\":\"KeyUsage\"}],\"Version\":\"2012-10-17\"}"
node_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-06030b690dc3cf699"
node_security_group_id = "sg-06030b690dc3cf699"
oidc_provider = "oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
oidc_provider_arn = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
self_managed_node_groups = {}
self_managed_node_groups_autoscaling_group_names = tolist([])

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_policy.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_policy" "aws_load_balancer_controller" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "eks-staging-load-balancer-controller"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_role" "aws_load_balancer_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-staging-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-staging-load-balancer-controller"
    }

  # helm_release.aws_load_balancer_controller[0] will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "eks-staging"
        }
      + set {
          + name  = "image.tag"
          + value = "v2.6.1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_iam_role.aws_load_balancer_controller[0]: Creating...
aws_iam_policy.aws_load_balancer_controller[0]: Creating...
aws_iam_policy.aws_load_balancer_controller[0]: Creation complete after 0s [id=arn:aws:iam::039454511521:policy/eks-staging-load-balancer-controller]
aws_iam_role.aws_load_balancer_controller[0]: Creation complete after 0s [id=eks-staging-load-balancer-controller]
aws_iam_role_policy_attachment.aws_load_balancer_controller[0]: Creating...
aws_iam_role_policy_attachment.aws_load_balancer_controller[0]: Creation complete after 0s [id=eks-staging-load-balancer-controller-20231010181222777400000001]
helm_release.aws_load_balancer_controller[0]: Creating...
helm_release.aws_load_balancer_controller[0]: Still creating... [10s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [20s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [30s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [40s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [50s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [1m0s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [1m10s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [1m20s elapsed]
helm_release.aws_load_balancer_controller[0]: Still creating... [1m30s elapsed]
helm_release.aws_load_balancer_controller[0]: Creation complete after 1m37s [id=aws-load-balancer-controller]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02a03faff519fa382]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-02dec8ba8180cdaaf]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0dd57cc2c0d5c564e]
aws_route_table.public[0]: Refreshing state... [id=rtb-08462bc1a1f939651]
aws_subnet.private[1]: Refreshing state... [id=subnet-0cbac79f5cdac698d]
aws_route_table.intra[0]: Refreshing state... [id=rtb-06f35047538be894d]
aws_subnet.private[0]: Refreshing state... [id=subnet-0f3b3a0b79843026c]
aws_subnet.private[2]: Refreshing state... [id=subnet-075985110aa9a2d0f]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ef05d06658abf6c1]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-08d118187c1c54973]
aws_subnet.public[2]: Refreshing state... [id=subnet-03cd59b9f0f679048]
aws_subnet.public[0]: Refreshing state... [id=subnet-01f526ebb2415f9c9]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b65faec2d074212a]
aws_subnet.intra[0]: Refreshing state... [id=subnet-0ef987da39abc9d14]
aws_route_table.private[0]: Refreshing state... [id=rtb-09e0d9b0846d7982f]
aws_subnet.intra[1]: Refreshing state... [id=subnet-028272c89d907907e]
aws_subnet.intra[2]: Refreshing state... [id=subnet-09b2d330a203e78fb]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0413a31dd5cbf860c]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08462bc1a1f9396511080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc6be7913239b648]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e7cac23638434d01]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-003ec8d6124888206]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-085192e6b0e585192]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d37ae4fecc63d975]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0793317483e167273]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0d72555520dfd6903]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0561cf1cd7aaa85f4]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-070e5944dc244b1c1]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ecf69b9d558b5773]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09e0d9b0846d7982f1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-09e0d9b0846d7982f",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-08d118187c1c54973"
default_route_table_id = "rtb-02dec8ba8180cdaaf"
default_security_group_id = "sg-0dd57cc2c0d5c564e"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-09e0d9b0846d7982f",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-0ef05d06658abf6c1"
igw_id = "igw-0ef05d06658abf6c1"
intra_route_table_association_ids = [
  "rtbassoc-0d72555520dfd6903",
  "rtbassoc-0561cf1cd7aaa85f4",
  "rtbassoc-070e5944dc244b1c1",
]
intra_route_table_ids = [
  "rtb-06f35047538be894d",
]
intra_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0ef987da39abc9d14",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-028272c89d907907e",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-09b2d330a203e78fb",
]
intra_subnets = [
  "subnet-0ef987da39abc9d14",
  "subnet-028272c89d907907e",
  "subnet-09b2d330a203e78fb",
]
intra_subnets_cidr_blocks = tolist([
  "10.0.6.0/24",
  "10.0.7.0/24",
  "10.0.8.0/24",
])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0413a31dd5cbf860c",
]
nat_public_ips = tolist([
  "35.170.124.248",
])
natgw_ids = [
  "nat-0ecf69b9d558b5773",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-09e0d9b0846d7982f1080289494",
]
private_route_table_association_ids = [
  "rtbassoc-0d37ae4fecc63d975",
  "rtbassoc-085192e6b0e585192",
  "rtbassoc-0793317483e167273",
]
private_route_table_ids = [
  "rtb-09e0d9b0846d7982f",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0f3b3a0b79843026c",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0cbac79f5cdac698d",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-075985110aa9a2d0f",
]
private_subnets = [
  "subnet-0f3b3a0b79843026c",
  "subnet-0cbac79f5cdac698d",
  "subnet-075985110aa9a2d0f",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-08462bc1a1f9396511080289494"
public_route_table_association_ids = [
  "rtbassoc-0e7cac23638434d01",
  "rtbassoc-0dc6be7913239b648",
  "rtbassoc-003ec8d6124888206",
]
public_route_table_ids = [
  "rtb-08462bc1a1f939651",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-01f526ebb2415f9c9",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0b65faec2d074212a",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-03cd59b9f0f679048",
]
public_subnets = [
  "subnet-01f526ebb2415f9c9",
  "subnet-0b65faec2d074212a",
  "subnet-03cd59b9f0f679048",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-09e0d9b0846d7982f",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-02a03faff519fa382"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-02a03faff519fa382"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-02dec8ba8180cdaaf"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>